# -AI-10-
#파이썬 프로그래밍의 기초, 자료형
# 숫자형
# 1.정수 a = 10, b = 3이 주어질 때 *사칙연산 결과(+, -, , /) 를 한 줄씩 출력하라.
>>> a=10
>>> b=3
>>> print(a+b)
13
>>> print(a-b)
7
>>> print(a*b)
30
>>> print(a/b)
3.333333333333335

# 2.정수 n이 주어질 때 n이 짝수면 “even”, 홀수면 "odd"를 출력하라.
>>> n=12
>>> print("even"if n%2==0 else "odd")
even

# 3.정수 n이 주어질 때 n의 제곱을 출력하라.
>>> n=3
>>> n**n
27

# 4.정수 n이 주어질 때 n의 절댓값을 출력하라.
>>> n=-9
>>> print(abs(n))
9

# 5.정수 a, b가 주어질 때 큰 수를 출력하라.
>>> a=7
>>> b=3
>>> print(a if a>b else b)
7

# 6.실수 x = 3.14159가 주어질 때 소수 둘째 자리까지 반올림하여 출력하라.
>>> x=3.14159
>>> round(x,2)
3.14

# 7.정수 n이 주어질 때 1부터 n까지의 합을 출력하라.
n=8
>>> print(sum(range(1,n+1)))
36

# 8.정수 n이 주어질 때 n의 자릿수 개수를 출력하라.
>>> n=123456789
>>> print(len(str(n)))
9

# 9.정수 n이 주어질 때 n이 3의 배수이면서 5의 배수인지 True / False로 출력하라.
>>> n=45
>>> print(n%3==0 and n%5==0)
True

# 10.정수 n이 주어질 때 n의 일의 자리 숫자를 출력하라.
>>> n=4972
>>> print(n%10)
2

